answer = input('Какой цвет котов вам больше всего нравится')
if answer == 'Черные':
    print('Вы верите в удачу')
elif answer == 'Белые':
    print('Вы очень веселый человек, так же наверняка цените красоту')
elif answer == 'Рыжие':
    print('Вам нравится что-то новое, вы не готовы стоять на одном месте')
else:
    print('Ошибка ввода, завершение программы')
    exit()
answer1 = input('Какого цвета ваши волосы?')
if answer1 == 'Черные':
    print('Вы очень добрый и приятный в общении человек')
elif answer1 == 'Блондин':
    print('Вам свойственно сострадание')
elif answer1 == 'Рыжие':
    print('Вы цените дружбу, у вас наверняка много друзей')
else:
    print('Ошибка ввода, завершение программы')
    exit()
answer2 = input('Какая звезда ваша самая любимая?')
if answer2 == 'Сириус':
    print('Вы любите сиять, всегда одеваетесь модно')
elif answer2 == 'Бетльгейзе':
    print('Вы живете завтрашним днем и ставите большие планы')
elif answer2 == 'Солнце':
    print('Вы наверняка живете на планете земля')
else:
    print('Ошибка ввода, завершение программы')
    exit()
